---
type: MassInstanceUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# MassInstanceUtils

`Autodesk.Revit.DB.MassInstanceUtils` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddMassLevelDataToMassInstance | 2012 | `public static ElementId AddMassLevelDataToMassInstance ( Document document , ElementId massInstanceId , ElementId levelId )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetGrossFloorArea | 2012 | `public static double GetGrossFloorArea ( Document document , ElementId massInstanceId )` |
| Method | GetGrossSurfaceArea | 2012 | `public static double GetGrossSurfaceArea ( Document document , ElementId massInstanceId )` |
| Method | GetGrossVolume | 2012 | `public static double GetGrossVolume ( Document document , ElementId massInstanceId )` |
| Method | GetJoinedElementIds | 2012 | `public static IList < ElementId > GetJoinedElementIds ( Document document , ElementId massInstanceId )` |
| Method | GetMassLevelDataIds | 2012 | `public static IList < ElementId > GetMassLevelDataIds ( Document document , ElementId massInstanceId )` |
| Method | GetMassLevelIds | 2012 | `public static IList < ElementId > GetMassLevelIds ( Document document , ElementId massInstanceId )` |
| Method | RemoveMassLevelDataFromMassInstance | 2012 | `public static void RemoveMassLevelDataFromMassInstance ( Document document , ElementId massInstanceId , ElementId levelId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |